class Config:
    # ------- Faker Config -------
    NUM_OF_EXAMPLES = 1000
    MAX_RESULTS = 20

    BUSINESS_NAMES = [
        "המבורגריה",
        "פיצה קינג",
        "שווארמה של המושבה",
        "שולחן של צח",
        "מסעדת עין הבשור",
        "פיצה טוני",
        "שווארמה בראדי",
        "המקדש של הסושי",
        "בורגר קינג",
        "פיצריה דומינו",
        "המקדש של הפיצה",
        "שווארמה טעם של בית",
        "סושי דוג",
        "שולחן קובי",
        "פיצת הבצק",
        "בר הקפה",
        "פיצה רומא",
        "שווארמה הים התיכון",
        "המבורגרייה של איציק",
        "דיינר 24 שעות",
        "שוקולד שוקולד",
        "פיצה בשרית",
        "מקדונלד'ס",
        "מסעדת בשרים מעושנים",
        "סלטים וירקות",
        "שווארמה אורי",
        "הבורגר של דוד",
        "פיצת דולצ'ה",
        "מסעדת יפו",
        "סושי על גלגלים"
    ]

    FOOD_TYPES = [
        "המבורגר",
        "פיצה",
        "שווארמה",
        "סושי",
        "מנה עיקרית",
        "איטלקי",
        "אסיאתי",
        "צמחוני",
        "ים תיכוני"
    ]

    KOSHER_CERTIFICATIONS = [
        "מהדרין",
        "מהדרין מן המהדרין",
        "בד\"ץ עדה חרדית",
        "בד\"ץ חסידות חב\"ד",
        "בד\"ץ פסקי דין",
        "בד\"ץ קרליבך",
        "OU",
        "OK",
        "רבנות תל אביב",
        "רבנות ירושלים",
        "רבנות קרית מלאכי",
        "רבנות פתח תקווה",
        "תעודת הכשר",
        "הרבנות הראשית לישראל",
        "KOF-K",
        "Star-K",
        "MK",
        "AOU",
        "Badatz London",
        "הגר\"י יוסף",
        "חלב ישראל",
        "חלב נוכרי",
        "פרווה"
    ]
